Repository: khalef-khalil/w8
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Weight Tracker
ar: تتبع الوزن
fr: Suivi de Poids

source: Add Weight
ar: إضافة وزن
fr: Ajouter Poids

source: Weight Tracking
ar: تتبع الوزن
fr: Suivi de Poids

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Error loading
ar: خطأ في التحميل
fr: Erreur lors du chargement

# startTrackingPrompt
source: Start tracking your weight
ar: ابدأ بتتبع وزنك
fr: Commencez à suivre votre poids

# addFirstWeighIn
source: Add your first weigh-in to get started
ar: أضف أول قياس وزن للبدء
fr: Ajoutez votre première pesée pour commencer

source: Current Weight
ar: الوزن الحالي
fr: Poids Actuel

source: Progress to goal
ar: التقدم نحو الهدف (+15 كجم)
fr: Progrès vers l'objectif (+15kg)

source: Start
ar: البداية
fr: Départ

source: Goal
ar: الهدف
fr: Objectif

source: Weeks
ar: أسابيع
fr: Semaines

source: Medians
ar: متوسطات
fr: Médianes

source: Not enough data
ar: لا توجد بيانات كافية
fr: Pas assez de données

# addWeighInsForChart
source: Add weigh-ins to see the chart
ar: أضف قياسات الوزن لرؤية الرسم البياني
fr: Ajoutez des pesées pour voir le graphique

source: Weekly Evolution
ar: التطور الأسبوعي (المتوسط)
fr: Évolution Hebdomadaire

source: Recent Weigh-ins
ar: قياسات الوزن الأخيرة
fr: Dernières Pesées

source: Today
ar: اليوم
fr: Aujourd'hui

source: Yesterday
ar: أمس
fr: Hier

source: Save
ar: حفظ
fr: Enregistrer

# weightSaved
source: Weight saved successfully
ar: تم حفظ الوزن بنجاح
fr: Poids enregistré avec succès

source: Validation error
ar: خطأ في التحقق
fr: Erreur de validation

source: Warning
ar: تحذير
fr: Avertissement

source: Cancel
ar: إلغاء
fr: Annuler

source: Confirm
ar: تأكيد
fr: Confirmer

source: Weight (kg)
ar: الوزن (كجم)
fr: Poids (kg)

source: Weight (lbs)
ar: الوزن (رطل)
fr: Poids (lbs)

# weightHint
source: e.g. 70.50
ar: مثال: 70.50
fr: Ex: 70.50

# targetWeightHint
source: e.g. 85.00
ar: مثال: 85.00
fr: Ex: 85.00

# errorWithMessage
source: Error: {message}
ar: خطأ: {message}
fr: Erreur : {message}

# pleaseEnterWeight
source: Please enter a weight
ar: يرجى إدخال وزن
fr: Veuillez entrer un poids

# pleaseEnterValidWeight
source: Please enter a valid weight (0–300 kg)
ar: يرجى إدخال وزن صحيح (0-300 كجم)
fr: Veuillez entrer un poids valide (0-300 kg)

# pleaseEnterValidWeightLbs
source: Please enter a valid weight (0–660 lbs)
ar: يرجى إدخال وزن صحيح (0-660 رطل)
fr: Veuillez entrer un poids valide (0–660 lbs)

source: Date
ar: التاريخ

source: Time
ar: الوقت
fr: Heure

source: Register
ar: تسجيل
fr: Enregistrer

# welcomeTitle
source: Welcome to w8
ar: مرحباً بك في w8
fr: Bienvenue dans w8

# welcomeSubtitle
source: Your companion for tracking weight progress. Gain 15kg in 6 months or set your own goal.
ar: رفيقك لتتبع تقدم وزنك. اكتسب 15 كجم في 6 أشهر أو حدد هدفك الخاص.
fr: Ton compagnon pour suivre ta progression de poids. Gagne 15kg en 6 mois ou définis ton propre objectif.

# featureMedianTitle
source: Smooth trends
ar: المتوسط الأسبوعي
fr: Médiane hebdomadaire

# featureMedianDesc
source: Your overview uses a 7-day rolling median; charts use weekly medians to smooth fluctuations.
ar: يحسب المتوسط تلقائياً لتخفيف التقلبات.
fr: Calcule automatiquement la médiane pour lisser les fluctuations.

# featureSmartTitle
source: Smart tracking
ar: تتبع ذكي
fr: Suivi intelligent

# featureSmartDesc
source: Detects anomalies and validates your data.
ar: يكتشف الشذوذات ويحقق من بياناتك.
fr: Détecte les anomalies et valide tes données.

# featureProgressTitle
source: Clear progress
ar: تقدم واضح
fr: Progression claire

# featureProgressDesc
source: See where you stand relative to your goal.
ar: انظر أين أنت بالنسبة لهدفك.
fr: Vois où tu en es par rapport à ton objectif.

source: Get Started
ar: ابدأ
fr: Commencer

# languageTitle
source: Choose your language
ar: اختر لغتك
fr: Choisis ta langue

# languageSubtitle
source: The app will use this language. You can change it later in settings.
ar: سيستخدم التطبيق هذه اللغة. يمكنك تغييرها لاحقاً في الإعدادات.
fr: L'app utilisera cette langue. Tu pourras la modifier plus tard dans les paramètres.

# goalConfigTitle
source: Goal configuration
ar: تكوين الهدف
fr: Configuration de l'objectif

# whatIsYourGoal
source: What's your goal?
ar: ما هو هدفك؟
fr: Quel est ton objectif ?

# configureGoal
source: Configure your personal goal
ar: قم بتكوين هدفك الشخصي
fr: Configure ton objectif personnalisé

source: Goal type
ar: نوع الهدف
fr: Type d'objectif

source: Gain
ar: زيادة
fr: Gagner

source: Lose
ar: فقدان
fr: Perdre

source: Maintain
ar: الحفاظ
fr: Maintenir

source: Initial weight (kg)
ar: الوزن الأولي (كجم)
fr: Poids initial (kg)

source: Target weight (kg)
ar: الوزن المستهدف (كجم)
fr: Poids cible (kg)

source: Goal start date
ar: تاريخ بداية الهدف
fr: Date de début de l'objectif

# selectDate
source: Select a date
ar: اختر تاريخاً
fr: Sélectionner une date

source: Duration (months)
ar: المدة (أشهر)
fr: Durée (mois)

# durationHint
source: e.g. 6
ar: مثال: 6
fr: Ex: 6

source: Goal End Date
ar: تاريخ نهاية الهدف
fr: Date de fin de l'objectif

source: Select End Date
ar: اختر تاريخ النهاية
fr: Sélectionner la date de fin

source: Use Duration
ar: استخدم المدة
fr: Utiliser la durée

source: Use End Date
ar: استخدم تاريخ النهاية
fr: Utiliser la date de fin

source: Calculated End Date
ar: تاريخ النهاية المحسوب
fr: Date de fin calculée

source: Calculated Duration
ar: المدة المحسوبة
fr: Durée calculée

# continueButton
source: Continue
ar: متابعة
fr: Continuer

# goalSummary
source: Your goal summary
ar: ملخص هدفك
fr: Résumé de ton objectif

# goalSummaryFromTo
source: From {initial}kg to {target}kg in {months} months
ar: من {initial} كجم إلى {target} كجم في {months} أشهر
fr: Passer de {initial}kg à {target}kg en {months} mois

# perMonth
source: ≈ {rate} kg/month
ar: ≈ {rate} كجم/شهر
fr: ≈ {rate} kg/mois

# enterInitialWeight
source: Enter an initial weight
ar: أدخل وزناً أولياً
fr: Entrez un poids initial

# enterTargetWeight
source: Enter a target weight
ar: أدخل وزناً مستهدفاً
fr: Entrez un poids cible

# enterDuration
source: Enter a duration
ar: أدخل مدة
fr: Entrez une durée

# invalidWeight
source: Invalid weight (0–500 kg)
ar: وزن غير صحيح (0-500 كجم)
fr: Poids invalide (0-500 kg)

# invalidDuration
source: Invalid duration (1–24 months)
ar: مدة غير صحيحة (1-24 شهراً)
fr: Durée invalide (1-24 mois)

# targetMustBeGreater
source: Target weight must be greater than initial weight for gain goals.
ar: يجب أن يكون الوزن المستهدف أكبر من الوزن الأولي لأهداف الزيادة.
fr: Le poids cible doit être supérieur au poids initial.

# targetMustBeLess
source: Target weight must be less than initial weight for loss goals.
ar: يجب أن يكون الوزن المستهدف أقل من الوزن الأولي لأهداف الفقدان.
fr: Le poids cible doit être inférieur au poids initial.

# errorSaving
source: Error saving entry. Please try again.
ar: خطأ في حفظ الإدخال. يرجى المحاولة مرة أخرى.
fr: Erreur lors de l'enregistrement. Veuillez réessayer.

source: Invalid data
ar: بيانات غير صحيحة
fr: Données invalides

# selectGoalType
source: Select a goal type
ar: اختر نوع الهدف
fr: Sélectionne un type d'objectif

# invalidGoalStartDate
source: Invalid start date
ar: تاريخ بداية غير صحيح
fr: Date de début invalide

# preferencesTitle
source: Preferences
ar: التفضيلات
fr: Préférences

# personalizeExperience
source: Personalize your experience
ar: خصص تجربتك
fr: Personnalise ton expérience

# configurePreferences
source: Configure your preferences for the best experience
ar: قم بتكوين تفضيلاتك للحصول على أفضل تجربة
fr: Configure tes préférences pour une expérience optimale

source: Weight unit
ar: وحدة الوزن
fr: Unité de poids

source: Kilograms
ar: كيلوغرامات
fr: Kilogrammes

source: Pounds
ar: أرطال
fr: Livres

source: Week starts on
ar: يبدأ الأسبوع في
fr: Début de semaine

source: Monday
ar: الاثنين
fr: Lundi

source: Tuesday
ar: الثلاثاء
fr: Mardi

source: Wednesday
ar: الأربعاء
fr: Mercredi

source: Thursday
ar: الخميس
fr: Jeudi

source: Friday
ar: الجمعة
fr: Vendredi

source: Saturday
ar: السبت
fr: Samedi

source: Sunday
ar: الأحد
fr: Dimanche

# firstWeighInTitle
source: First weigh-in
ar: أول قياس وزن
fr: Première pesée

# addFirstWeighInTitle
source: Add your first weigh-in
ar: أضف أول قياس وزن
fr: Ajoute ta première pesée

# yourGoalIs
source: Your goal: {initial}kg → {target}kg in {months} months
ar: هدفك: {initial} كجم → {target} كجم في {months} أشهر
fr: Ton objectif : {initial}kg → {target}kg en {months} mois

# initialWeightConfigured
source: Initial weight configured: {weight}kg
ar: الوزن الأولي المكون: {weight} كجم
fr: Poids initial configuré : {weight}kg

# weightVeryDifferent
source: Weight very different from configured initial. Please check.
ar: الوزن مختلف جداً عن الوزن الأولي المكون. يرجى التحقق.
fr: Poids très différent du poids initial. Vérifiez votre saisie.

source: Finish and start
ar: إنهاء والبدء
fr: Terminer et commencer

source: Insights
ar: رؤى

source: Ahead
ar: متقدم
fr: En avance

source: Behind
ar: متأخر
fr: En retard

source: On track
ar: على المسار الصحيح
fr: Sur la bonne voie

# daysAhead
source: {count} days ahead
ar: متقدم {count} أيام
fr: {count} jours d'avance

# daysBehind
source: {count} days behind
ar: متأخر {count} أيام
fr: {count} jours de retard

source: Keep it up!
ar: استمر!
fr: Continue comme ça !

source: Speed of progress
ar: سرعة التقدم
fr: Vitesse de progression

source: Current
ar: الحالي
fr: Actuelle

source: Required
ar: المطلوب
fr: Requise

# kgPerWeek
source: kg/week
ar: كجم/أسبوع
fr: kg/S

# percentOfRequired
source: {percent}% of required speed
ar: {percent}% من السرعة المطلوبة
fr: {percent}% de la vitesse requise

source: Prediction
ar: التنبؤ
fr: Prédiction

# goalReachedInDays
source: Goal reached in {count} days
ar: سيتم الوصول للهدف في {count} أيام
fr: Objectif atteint dans {count} jours

# estimatedDate
source: Estimated date: {date}
ar: التاريخ المقدر: {date}
fr: Date estimée : {date}

# daysAfterExpected
source: {count} days after expected
ar: {count} أيام بعد المتوقع
fr: {count} jours après la date prévue

# daysBeforeExpected
source: {count} days before expected
ar: {count} أيام قبل المتوقع
fr: {count} jours avant la date prévue

# progressVsTime
source: Progress: Time vs Weight
ar: التقدم: الوقت مقابل الوزن
fr: Progression : Temps vs Poids

source: Time progress
ar: تقدم الوقت
fr: Progression temporelle

source: Time elapsed
ar: الوقت المنقضي
fr: Temps écoulé

source: Weight progress
ar: تقدم الوزن
fr: Progression poids

source: Actual change
ar: التغيير الفعلي
fr: Gain/perte réel

source: Ahead by {percent}%
ar: متقدم بنسبة {percent}%
fr: En avance de {percent}%

source: Behind by {percent}%
ar: متأخر بنسبة {percent}%
fr: En retard de {percent}%

# perfectlySynced
source: Perfectly in sync with your goal
ar: متزامن تماماً مع هدفك
fr: Parfaitement synchronisé avec l'objectif

# settingsTitle
source: Settings
ar: الإعدادات
fr: Paramètres

# progressTitle
source: Progress
ar: التقدم
fr: Progression

# historyTitle
source: History
ar: السجل
fr: Historique

# insightsTitle
source: Insights
ar: الرؤى

# navHome
source: Home
ar: الرئيسية
fr: Accueil

# navProgress
source: Progress
ar: التقدم
fr: Progression

# navHistory
source: History
ar: السجل
fr: Historique

# navInsights
source: Insights
ar: الرؤى

# navSettings
source: Settings
ar: الإعدادات
fr: Paramètres

# navOverview
source: Overview
ar: نظرة عامة
fr: Vue d'ensemble

# overviewTitle
source: Overview
ar: نظرة عامة
fr: Vue d'ensemble

# monthsUnit
source: months
ar: أشهر
fr: mois

# kgUnit
source: kg
ar: كجم

# lbsUnit
source: lbs
ar: رطل

# lbsPerWeek
source: lbs/week
ar: رطل/أسبوع
fr: lbs/semaine

# progressLabel
source: Progress
ar: التقدم
fr: Progression

# weightToGo
source: {value} kg to go
ar: {value} كجم متبقية
fr: {value} kg à prendre

# weightToLose
source: {value} kg to lose
ar: {value} كجم للفقدان
fr: {value} kg à perdre

# weightToGoLabel
source: Weight to go
ar: الوزن المتبقي
fr: À prendre

# weightToLoseLabel
source: Weight to lose
ar: الوزن للفقدان
fr: À perdre

# weeksLeft
source: {count} weeks left
ar: متبقي {count} أسابيع
fr: {count} semaines restantes

# weeksLeftLabel
source: Weeks left
ar: الأسابيع المتبقية
fr: Semaines restantes

source: Goal weight
ar: الوزن المستهدف
fr: Poids objectif

# chartGoalLine
source: Goal
ar: الهدف
fr: Objectif

# chartStartLine
source: Start
ar: البداية
fr: Départ

source: Edit
ar: تعديل
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

source: Edit weight
ar: تعديل الوزن
fr: Modifier la pesée

# deleteEntryTitle
source: Delete weigh-in?
ar: حذف قياس الوزن؟
fr: Supprimer cette pesée ?

# deleteEntryMessage
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action est irréversible.

# entryDeleted
source: Weigh-in deleted
ar: تم حذف قياس الوزن
fr: Pesée supprimée

# weightUpdated
source: Weigh-in updated
ar: تم تحديث قياس الوزن
fr: Pesée mise à jour

source: Data Management
ar: إدارة البيانات
fr: Gestion des données

source: Export Data
ar: تصدير البيانات
fr: Exporter les données

# exportDataDescription
source: Export your weight data to CSV or JSON format
ar: قم بتصدير بيانات وزنك بتنسيق CSV أو JSON
fr: Exporter tes données de poids au format CSV ou JSON

source: Export as CSV
ar: تصدير كـ CSV
fr: Exporter en CSV

# exportAsCSVDescription
source: Comma-separated values format, easy to open in Excel
ar: تنسيق قيم مفصولة بفواصل، سهل الفتح في Excel
fr: Format valeurs séparées par des virgules, facile à ouvrir dans Excel

source: Export as JSON
ar: تصدير كـ JSON
fr: Exporter en JSON

# exportAsJSONDescription
source: JSON format with all data including goal configuration
ar: تنسيق JSON مع جميع البيانات بما في ذلك تكوين الهدف
fr: Format JSON avec toutes les données incluant la configuration de l'objectif

# exportDataReady
source: Your data is ready to copy:
ar: بياناتك جاهزة للنسخ:
fr: Tes données sont prêtes à être copiées :

source: Copy to Clipboard
ar: نسخ إلى الحافظة
fr: Copier dans le presse-papiers

source: Data copied to clipboard
ar: تم نسخ البيانات إلى الحافظة
fr: Données copiées dans le presse-papiers

# errorExporting
source: Error exporting data
ar: خطأ في التصدير
fr: Erreur lors de l'exportation

source: Close
ar: إغلاق
fr: Fermer

source: Current Streak
ar: السلسلة الحالية
fr: Série actuelle

# daysInARow
source: {count} days in a row
ar: {count} أيام متتالية
fr: {count} jours d'affilée

# longestStreak
source: Longest: {count} days
ar: الأطول: {count} أيام
fr: Record : {count} jours

source: Making progress
ar: إحراز تقدم
fr: En progression

source: Just checking
ar: التحقق فقط
fr: Vérification

source: Yes, continue
ar: نعم، متابعة
fr: Oui, continuer

# weightSavedSuccess
source: Great! Weight saved successfully
ar: رائع! تم حفظ الوزن بنجاح
fr: Parfait ! Poids enregistré avec succès

# weightUpdatedSuccess
source: Updated! Your entry has been saved
ar: تم التحديث! تم حفظ إدخالك
fr: Mis à jour ! Ton entrée a été sauvegardée

source: Edit Goal
ar: تعديل الهدف
fr: Modifier l'objectif

source: Edit Your Goal
ar: عدل هدفك
fr: Modifier ton objectif

# editGoalDescription
source: Update your goal settings
ar: قم بتحديث إعدادات هدفك
fr: Mettre à jour les paramètres de ton objectif

source: Goal Management
ar: إدارة الهدف
fr: Gestion de l'objectif

# goalUpdated
source: Goal updated successfully
ar: تم تحديث الهدف بنجاح
fr: Objectif mis à jour avec succès

source: Initial weight (lbs)
ar: الوزن الأولي (رطل)
fr: Poids initial (lbs)

source: Target weight (lbs)
ar: الوزن المستهدف (رطل)
fr: Poids cible (lbs)

source: Reminders
ar: التذكيرات
fr: Rappels

# enableReminders
source: Enable Daily Reminders
ar: تفعيل التذكيرات اليومية
fr: Activer les rappels quotidiens

# enableRemindersDescription
source: Get notified to track your weight
ar: احصل على إشعار لتتبع وزنك
fr: Recevoir une notification pour enregistrer ton poids

source: Reminder Time
ar: وقت التذكير
fr: Heure du rappel

# notificationPermissionRequired
source: Notification permission is required to enable reminders
ar: إذن الإشعارات مطلوب لتفعيل التذكيرات
fr: La permission de notification est requise pour activer les rappels

source: Not set
ar: غير محدد
fr: Non défini

source: Achievements
ar: الإنجازات
fr: Succès

# achievementsProgress
source: {unlocked} of {total} unlocked
ar: {unlocked} من {total} مفتوحة
fr: {unlocked} sur {total} débloqués

# noAchievementsYet
source: Keep tracking to unlock achievements!
ar: استمر في التتبع لفتح الإنجازات!
fr: Continue à suivre pour débloquer des succès !

# viewAllAchievements
source: View All
ar: عرض الكل
fr: Voir tout

# achievementUnlocked
source: Unlocked: {date}
ar: مفتوح: {date}
fr: Débloqué : {date}

# achievementJourneyStarted
source: Journey Started
ar: بدأت الرحلة
fr: Voyage commencé

# achievementJourneyStartedDesc
source: You've started your weight tracking journey!
ar: لقد بدأت رحلة تتبع وزنك!
fr: Tu as commencé ton voyage de suivi de poids !

# achievementWeekWarrior
source: Week Warrior
ar: محارب الأسبوع
fr: Guerrier de la semaine

# achievementWeekWarriorDesc
source: Tracked your weight for 7 days in a row!
ar: لقد تتبعت وزنك لمدة 7 أيام متتالية!
fr: Tu as suivi ton poids pendant 7 jours d'affilée !

# achievementMonthlyMaster
source: Monthly Master
ar: سيد الشهر
fr: Maître mensuel

# achievementMonthlyMasterDesc
source: Tracked your weight for 30 days in a row!
ar: لقد تتبعت وزنك لمدة 30 يوماً متتالية!
fr: Tu as suivi ton poids pendant 30 jours d'affilée !

# achievementCenturyChampion
source: Century Champion
ar: بطل المئة
fr: Champion du siècle

# achievementCenturyChampionDesc
source: Tracked your weight for 100 days in a row!
ar: لقد تتبعت وزنك لمدة 100 يوم متتالية!
fr: Tu as suivi ton poids pendant 100 jours d'affilée !

# achievementQuarterComplete
source: Quarter Complete
ar: ربع مكتمل
fr: Quart terminé

# achievementQuarterCompleteDesc
source: You're 25% of the way to your goal!
ar: أنت عند 25% من هدفك!
fr: Tu es à 25% de ton objectif !

# achievementHalfwayHero
source: Halfway Hero
ar: بطل منتصف الطريق
fr: Héros à mi-chemin

# achievementHalfwayHeroDesc
source: You're halfway to your goal!
ar: أنت في منتصف الطريق إلى هدفك!
fr: Tu es à mi-chemin de ton objectif !

# achievementAlmostThere
source: Almost There
ar: تقريباً هناك
fr: Presque là

# achievementAlmostThereDesc
source: You're 75% of the way to your goal!
ar: أنت عند 75% من هدفك!
fr: Tu es à 75% de ton objectif !

# achievementGoalAchieved
source: Goal Achieved
ar: تم تحقيق الهدف
fr: Objectif atteint

# achievementGoalAchievedDesc
source: Congratulations! You've reached your goal!
ar: تهانينا! لقد حققت هدفك!
fr: Félicitations ! Tu as atteint ton objectif !

# achievement10DayTracker
source: 10 Day Tracker
ar: متتبع 10 أيام
fr: Suiveur de 10 jours

# achievement10DayTrackerDesc
source: Tracked your weight for 10 days total!
ar: لقد تتبعت وزنك لمدة 10 أيام إجمالاً!
fr: Tu as suivi ton poids pendant 10 jours au total !

# achievement30DayTracker
source: 30 Day Tracker
ar: متتبع 30 يوماً
fr: Suiveur de 30 jours

# achievement30DayTrackerDesc
source: Tracked your weight for 30 days total!
ar: لقد تتبعت وزنك لمدة 30 يوماً إجمالاً!
fr: Tu as suivi ton poids pendant 30 jours au total !

# achievement100DayTracker
source: 100 Day Tracker
ar: متتبع 100 يوم
fr: Suiveur de 100 jours

# achievement100DayTrackerDesc
source: Tracked your weight for 100 days total!
ar: لقد تتبعت وزنك لمدة 100 يوم إجمالاً!
fr: Tu as suivi ton poids pendant 100 jours au total !

# addContext
source: Add Context (Optional)
ar: إضافة سياق (اختياري)
fr: Ajouter du contexte (optionnel)

# addContextDescription
source: Track factors that might affect your weight
ar: تتبع العوامل التي قد تؤثر على وزنك
fr: Suivre les facteurs qui peuvent affecter ton poids

source: Sleep Quality
ar: جودة النوم
fr: Qualité du sommeil

source: Stress Level
ar: مستوى التوتر
fr: Niveau de stress

source: Exercised Today
ar: تم التمرين اليوم
fr: Exercice aujourd'hui

source: Meal Timing
ar: توقيت الوجبة
fr: Moment du repas

# selectMealTiming
source: Select when you weighed
ar: اختر متى قمت بالوزن
fr: Sélectionne quand tu t'es pesé

source: Before Breakfast
ar: قبل الإفطار
fr: Avant le petit-déjeuner

source: After Breakfast
ar: بعد الإفطار
fr: Après le petit-déjeuner

source: Before Lunch
ar: قبل الغداء
fr: Avant le déjeuner

source: After Lunch
ar: بعد الغداء
fr: Après le déjeuner

source: Before Dinner
ar: قبل العشاء
fr: Avant le dîner

source: After Dinner
ar: بعد العشاء
fr: Après le dîner

source: Other
ar: أخرى
fr: Autre

source: Notes
ar: ملاحظات

# notesHint
source: Add any additional notes...
ar: أضف أي ملاحظات إضافية...
fr: Ajoute des notes supplémentaires...

source: Pattern Insights
ar: رؤى الأنماط
fr: Insights de patterns

source: Try this
ar: جرب هذا
fr: Essaie ceci

source: Learn more
ar: تعلم المزيد
fr: En savoir plus

source: Got it
ar: فهمت
fr: Compris

# tipsAndEducation
source: Tips & Education
ar: نصائح وتعليم
fr: Conseils et éducation

# tipsAndEducationDescription
source: Learn about weight tracking and best practices
ar: تعلم عن تتبع الوزن وأفضل الممارسات
fr: Apprendre sur le suivi du poids et les meilleures pratiques

source: All Achievements
ar: جميع الإنجازات
fr: Tous les succès

source: Recommendations
ar: التوصيات
fr: Recommandations

source: Appearance
ar: المظهر
fr: Apparence

source: Theme
ar: المظهر
fr: Thème

# lightTheme
source: Light
ar: فاتح
fr: Clair

# darkTheme
source: Dark
ar: داكن
fr: Sombre

# systemTheme
source: System
ar: النظام
fr: Système

source: Select Theme
ar: اختر المظهر
fr: Sélectionner le thème

source: Time range
ar: النطاق الزمني
fr: Période

source: Last 4 weeks
ar: آخر 4 أسابيع
fr: 4 dernières semaines

source: Last 3 months
ar: آخر 3 أشهر
fr: 3 derniers mois

source: Last 6 months
ar: آخر 6 أشهر
fr: 6 derniers mois

source: All time
ar: كل الوقت
fr: Tout

source: Zoomed in
ar: مكبر
fr: Zoom activé

# resetZoom
source: Reset
ar: إعادة تعيين
fr: Réinitialiser

source: data points
ar: نقاط البيانات
fr: points de données

source: Midpoint
ar: النقطة الوسطى
fr: Milieu

source: Latest
ar: الأحدث
fr: Dernier

source: Load more
ar: تحميل المزيد
fr: Charger plus

source: Something went wrong
ar: حدث خطأ ما
fr: Une erreur s'est produite

# errorOccurred
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
fr: Une erreur s'est produite. Veuillez réessayer.

source: Go back
ar: العودة
fr: Retour

# errorDeleting
source: Error deleting entry. Please try again.
ar: خطأ في حذف الإدخال. يرجى المحاولة مرة أخرى.
fr: Erreur lors de la suppression. Veuillez réessayer.

source: Back
ar: رجوع
fr: Retour

source: Awesome!
ar: رائع!
fr: Génial !

# celebrationJourneyStarted
source: Journey Started!
ar: بدأت الرحلة!

# celebrationJourneyStartedMessage
source: Great! You've started your journey!
ar: رائع! لقد بدأت رحلتك!

# celebration7DayStreak
source: 7 Day Streak!
ar: سلسلة 7 أيام!

# celebration7DayStreakMessage
source: 🎉 7 days in a row! You're building an amazing habit!
ar: 🎉 7 أيام متتالية! أنت تبني عادة رائعة!

# celebration30DayStreak
source: 30 Day Streak!
ar: سلسلة 30 يوماً!

# celebration30DayStreakMessage
source: 🎉 30 days! You're a tracking superstar!
ar: 🎉 30 يوماً! أنت نجم في التتبع!

# celebration100DayStreak
source: 100 Day Streak!
ar: سلسلة 100 يوم!

# celebration100DayStreakMessage
source: 🎉 100 days! This is incredible dedication!
ar: 🎉 100 يوم! هذا تفانٍ لا يصدق!

# celebration25Percent
source: 25% Complete!
ar: 25% مكتمل!

# celebration25PercentMessage
source: 🎉 You're 25% there! Keep going!
ar: 🎉 أنت عند 25%! استمر!

# celebration50Percent
source: Halfway There!
ar: في منتصف الطريق!

# celebration50PercentMessage
source: 🎉 Halfway there! You're doing amazing!
ar: 🎉 في منتصف الطريق! أنت تقوم بعمل رائع!

# celebration75Percent
source: 75% Complete!
ar: 75% مكتمل!

# celebration75PercentMessage
source: 🎉 75% complete! You're almost there!
ar: 🎉 75% مكتمل! أنت على وشك الوصول!

# celebrationGoalReached
source: Goal Achieved!
ar: تم تحقيق الهدف!
