Repository: khalef-khalil/w8
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# celebrationGoalReachedMessage
source: 🎉 Congratulations! You've reached your goal!
ar: 🎉 تهانينا! لقد حققت هدفك!

# emptyStateStartJourney
source: Start Your Journey
ar: ابدأ رحلتك

# emptyStateStartJourneyMessage
source: Track your weight to see your progress over time. Every entry brings you closer to your goal!
ar: تتبع وزنك لرؤية تقدمك مع مرور الوقت. كل إدخال يقربك من هدفك!

# emptyStateAddFirstWeight
source: Add Your First Weight
ar: أضف وزنك الأول

# emptyStateSetGoal
source: Set Your Goal
ar: حدد هدفك

# emptyStateSetGoalMessage
source: Define your weight goal to track your progress and stay motivated on your journey!
ar: حدد هدف وزنك لتتبع تقدمك والبقاء متحفزاً في رحلتك!

# emptyStateNoHistory
source: No History Yet
ar: لا يوجد سجل بعد

# emptyStateNoHistoryMessage
source: Start tracking your weight to build your history. Consistency is key to success!
ar: ابدأ بتتبع وزنك لبناء سجلك. الاتساق هو مفتاح النجاح!

# emptyStateAddWeightEntry
source: Add Weight Entry
ar: إضافة إدخال وزن

# emptyStateBuildingInsights
source: Building Insights
ar: بناء الرؤى

# emptyStateBuildingInsightsMessage
source: Keep tracking your weight! Once you have enough data, we'll show you personalized insights and trends.
ar: استمر في تتبع وزنك! بمجرد أن يكون لديك بيانات كافية، سنعرض لك رؤى واتجاهات مخصصة.

# recommendationBehindLoss
source: You're {deficit} {unit}/week behind target. Consider reviewing your nutrition and activity levels.
ar: أنت متأخر {deficit} {unit}/أسبوع عن الهدف. فكر في مراجعة تغذيتك ومستويات نشاطك.
fr: Tu es {deficit} {unit}/semaine en retard sur l'objectif. Considère revoir ta nutrition et tes niveaux d'activité.

# recommendationSmallChanges
source: Small changes add up: try adding 10-15 minutes of daily activity or reducing portion sizes slightly.
ar: التغييرات الصغيرة تتراكم: جرب إضافة 10-15 دقيقة من النشاط اليومي أو تقليل أحجام الوجبات قليلاً.
fr: Les petits changements s'accumulent : essaie d'ajouter 10-15 minutes d'activité quotidienne ou de réduire légèrement les portions.

# recommendationBehindGain
source: You're {deficit} {unit}/week behind target. Make sure you're eating enough calories and protein.
ar: أنت متأخر {deficit} {unit}/أسبوع عن الهدف. تأكد من أنك تأكل سعرات حرارية وبروتين كافيين.
fr: Tu es {deficit} {unit}/semaine en retard sur l'objectif. Assure-toi de manger assez de calories et de protéines.

# recommendationTrackMeals
source: Consider tracking your meals to ensure you're meeting your caloric goals.
ar: فكر في تتبع وجباتك لضمان تحقيق أهدافك من السعرات الحرارية.
fr: Considère suivre tes repas pour t'assurer de rencontrer tes objectifs caloriques.

# recommendationAhead
source: Great progress! You're ahead of schedule. Keep up the consistent tracking and maintain your current approach.
ar: تقدم رائع! أنت متقدم على الجدول. استمر في التتبع المتسق وحافظ على نهجك الحالي.
fr: Super progrès ! Tu es en avance. Continue le suivi cohérent et maintiens ton approche actuelle.

# recommendationOnTrack
source: You're right on track! Maintain your current routine - it's working well.
ar: أنت على المسار الصحيح! حافظ على روتينك الحالي - إنه يعمل بشكل جيد.
fr: Tu es sur la bonne voie ! Maintiens ta routine actuelle - ça fonctionne bien.

# recommendationFinalStretch
source: You're in the final stretch! Stay consistent - you're almost there!
ar: أنت في المرحلة الأخيرة! ابق متسقاً - أنت على وشك الوصول!
fr: Tu es dans la dernière ligne droite ! Reste cohérent - tu y es presque !

# recommendationHalfway
source: You're more than halfway there! Keep the momentum going.
ar: أنت تجاوزت منتصف الطريق! حافظ على الزخم.
fr: Tu es plus qu'à mi-chemin ! Garde l'élan.

# recommendationGettingStarted
source: You're just getting started. Focus on building consistent habits - the results will follow!
ar: أنت للتو بدأت. ركز على بناء عادات متسقة - النتائج ستتبع!
fr: Tu commences juste. Concentre-toi sur la construction d'habitudes cohérentes - les résultats suivront !

# recommendationVolatility
source: Your weight is fluctuating quite a bit. This is normal! Try weighing at the same time each day for more consistent readings.
ar: وزنك يتقلب كثيراً. هذا طبيعي! جرب الوزن في نفس الوقت كل يوم للحصول على قراءات أكثر اتساقاً.
fr: Ton poids fluctue beaucoup. C'est normal ! Essaie de te peser à la même heure chaque jour pour des lectures plus cohérentes.

# recommendationGeneral
source: Keep tracking consistently! Every entry helps you understand your progress better.
ar: استمر في التتبع بانتظام! كل إدخال يساعدك على فهم تقدمك بشكل أفضل.
fr: Continue à suivre régulièrement ! Chaque entrée t'aide à mieux comprendre ta progression.

# encouragementGoalReached
source: 🎉 Congratulations! You've reached your goal!
ar: 🎉 تهانينا! لقد حققت هدفك!
fr: 🎉 Félicitations ! Tu as atteint ton objectif !

# encouragementAhead
source: You're doing amazing! Keep up the great work!
ar: أنت تقوم بعمل رائع! استمر في العمل الجيد!
fr: Tu fais du super travail ! Continue comme ça !

# encouragementOnTrack
source: You're right on track! Consistency is key.
ar: أنت على المسار الصحيح! الاتساق هو المفتاح.
fr: Tu es sur la bonne voie ! La cohérence est la clé.

# encouragementClose
source: You're so close! Keep pushing forward!
ar: أنت قريب جداً! استمر في المضي قدماً!
fr: Tu es si proche ! Continue d'avancer !

# encouragementGreatProgress
source: You're making great progress! Keep going!
ar: أنت تحرز تقدماً رائعاً! استمر!
fr: Tu fais de super progrès ! Continue !

# encouragementEveryStep
source: Every step counts! You're building great habits!
ar: كل خطوة مهمة! أنت تبني عادات رائعة!
fr: Chaque pas compte ! Tu construis de grandes habitudes !

# patternSleepQualityImpact
source: Sleep Quality Impact
ar: تأثير جودة النوم
fr: Impact de la qualité du sommeil

# patternSleepQualityDescription
source: You tend to {action} more weight when you sleep {quality} ({rating}/5). When sleep quality is {worstRating}/5, your weight changes by {change} kg/day on average.
ar: تميل إلى {action} المزيد من الوزن عندما تنام {quality} ({rating}/5). عندما تكون جودة النوم {worstRating}/5، يتغير وزنك بمقدار {change} كجم/يوم في المتوسط.
fr: Tu tends à {action} plus de poids quand tu dors {quality} ({rating}/5). Quand la qualité du sommeil est {worstRating}/5, ton poids change de {change} kg/jour en moyenne.

# patternSleepQualitySimilar
source: Your weight changes are similar regardless of sleep quality.
ar: تغييرات وزنك متشابهة بغض النظر عن جودة النوم.
fr: Tes changements de poids sont similaires quelle que soit la qualité du sommeil.

# patternSleepQualitySuggestionGood
source: Try to maintain good sleep habits ({rating}/5) for better weight management.
ar: حاول الحفاظ على عادات نوم جيدة ({rating}/5) لإدارة أفضل للوزن.
fr: Essaie de maintenir de bonnes habitudes de sommeil ({rating}/5) pour une meilleure gestion du poids.

# patternSleepQualitySuggestionImprove
source: Consider improving your sleep quality - it may help with your weight goals.
ar: فكر في تحسين جودة نومك - قد يساعد في أهداف وزنك.
fr: Considère améliorer ta qualité de sommeil - cela peut aider avec tes objectifs de poids.

# patternStressLevelImpact
source: Stress Level Impact
ar: تأثير مستوى التوتر
fr: Impact du niveau de stress

# patternStressLevelDescription
source: When stress is {level} ({rating}/5), your weight changes by {change} kg/day on average. Higher stress ({highRating}/5) shows {highChange} kg/day.
ar: عندما يكون التوتر {level} ({rating}/5)، يتغير وزنك بمقدار {change} كجم/يوم في المتوسط. التوتر الأعلى ({highRating}/5) يظهر {highChange} كجم/يوم.
fr: Quand le stress est {level} ({rating}/5), ton poids change de {change} kg/jour en moyenne. Un stress plus élevé ({highRating}/5) montre {highChange} kg/jour.

# patternStressLevelSuggestion
source: Managing stress levels may help with your weight goals.
ar: إدارة مستويات التوتر قد تساعد في أهداف وزنك.
fr: Gérer les niveaux de stress peut aider avec tes objectifs de poids.

# patternStressLevelSuggestionFavorable
source: Your weight changes are more favorable when stress is lower.
ar: تغييرات وزنك أكثر ملاءمة عندما يكون التوتر أقل.
fr: Tes changements de poids sont plus favorables quand le stress est plus bas.

# patternExerciseImpact
source: Exercise Impact
ar: تأثير التمرين
fr: Impact de l'exercice

# patternExerciseDescription
source: On days you exercise, your weight changes by {withExercise} kg/day on average, compared to {withoutExercise} kg/day when you don't exercise.
ar: في الأيام التي تمارس فيها التمرين، يتغير وزنك بمقدار {withExercise} كجم/يوم في المتوسط، مقارنة بـ {withoutExercise} كجم/يوم عندما لا تمارس التمرين.
fr: Les jours où tu fais de l'exercice, ton poids change de {withExercise} kg/jour en moyenne, comparé à {withoutExercise} kg/jour quand tu ne fais pas d'exercice.

# patternExerciseDescriptionAlt
source: Exercise days show {withExercise} kg/day change vs {withoutExercise} kg/day on rest days.
ar: أيام التمرين تظهر {withExercise} كجم/يوم تغيير مقابل {withoutExercise} كجم/يوم في أيام الراحة.
fr: Les jours d'exercice montrent {withExercise} kg/jour de changement vs {withoutExercise} kg/jour les jours de repos.

# patternExerciseSuggestion
source: Keep up the exercise! It appears to be helping with your weight goals.
ar: استمر في التمرين! يبدو أنه يساعد في أهداف وزنك.
fr: Continue l'exercice ! Il semble aider avec tes objectifs de poids.

# patternExerciseSuggestionConsistent
source: Consider maintaining a consistent exercise routine.
ar: فكر في الحفاظ على روتين تمرين متسق.
fr: Considère maintenir une routine d'exercice cohérente.

# patternMealTimingPattern
source: Meal Timing Pattern
ar: نمط توقيت الوجبة
fr: Modèle de timing des repas

# patternMealTimingDescription
source: Your weight changes are most favorable when weighing {timing}. Average change: {change} kg/day.
ar: تغييرات وزنك الأكثر ملاءمة عند الوزن {timing}. متوسط التغيير: {change} كجم/يوم.
fr: Tes changements de poids sont les plus favorables quand tu te pèses {timing}. Changement moyen : {change} kg/jour.

# patternMealTimingSuggestion
source: Try to weigh yourself at consistent times ({timing}) for more accurate tracking.
ar: حاول وزن نفسك في أوقات متسقة ({timing}) لتتبع أكثر دقة.
fr: Essaie de te peser à des heures cohérentes ({timing}) pour un suivi plus précis.

# patternSleepWell
source: well
ar: جيداً
fr: bien

# patternSleepPoorly
source: poorly
ar: سيئاً
fr: mal

# patternStressLow
source: low
ar: منخفض
fr: bas

# patternStressHigh
source: high
ar: مرتفع
fr: élevé

# patternLose
source: lose
ar: فقدان
fr: perdre

# patternGain
source: gain
ar: زيادة
fr: gagner

# educationWhyFluctuatesTitle
source: Why Weight Fluctuates Daily
ar: لماذا يتقلب الوزن يومياً
fr: Pourquoi le poids fluctue quotidiennement

# educationWhyFluctuatesContent
source: Your weight naturally fluctuates throughout the day and week. This is completely normal! Factors include: • Water retention (can vary by 1-2 kg) • Food and digestion • Sleep quality and duration • Hormonal changes • Exercise and muscle recovery That's why we use a 7-day rolling median for your current weight and weekly medians in charts - they smooth out daily noise and show your true progress.
ar: وزنك يتقلب بشكل طبيعي طوال اليوم والأسبوع. هذا طبيعي تماماً! العوامل تشمل: • احتباس الماء (يمكن أن يختلف من 1-2 كجم) • الطعام والهضم • جودة ومدة النوم • التغيرات الهرمونية • التمرين واستعادة العضلات لهذا السبب نستخدم المتوسطات الأسبوعية - فهي تنعم الضوضاء اليومية وتظهر تقدمك الحقيقي.
fr: Ton poids fluctue naturellement tout au long de la journée et de la semaine. C'est complètement normal ! Les facteurs incluent : • Rétention d'eau (peut varier de 1-2 kg) • Nourriture et digestion • Qualité et durée du sommeil • Changements hormonaux • Exercice et récupération musculaire C'est pourquoi nous utilisons les médianes hebdomadaires - elles lissent le bruit quotidien et montrent ton vrai progrès.

# educationWeeklyMediansTitle
source: How We Smooth Your Data
ar: كيف تعمل المتوسطات الأسبوعية
fr: Comment fonctionnent les médianes hebdomadaires

# educationWeeklyMediansContent
source: Your current weight on the overview is a 7-day rolling median: the median of all weigh-ins in the last 7 days (or your last weigh-in if none in that window). This keeps the number responsive and robust to outliers. Charts use weekly medians: we take the median weight for each full week (Mon–Sun). That gives a stable trend over time. For example: if you weigh 70kg, 71kg, 70.5kg, 70.2kg, and 70.8kg in a week, the median is 70.5kg - a more stable number than any single day.
ar: المتوسطات الأسبوعية تساعدك على رؤية تقدمك الحقيقي عن طريق تقليل الضوضاء اليومية. بدلاً من التركيز على التغييرات يوم بيوم، نحسب متوسط الوزن لكل أسبوع. هذا يعطيك صورة أوضح لاتجاهك العام. على سبيل المثال: إذا كنت تزن 70 كجم، 71 كجم، 70.5 كجم، 70.2 كجم، و 70.8 كجم في أسبوع، المتوسط هو 70.5 كجم - رقم أكثر استقراراً من أي يوم واحد.
fr: Les médianes hebdomadaires t'aident à voir ton vrai progrès en réduisant le bruit quotidien. Au lieu de se concentrer sur les changements jour par jour, nous calculons le poids médian pour chaque semaine. Cela te donne une image plus claire de ta tendance globale. Par exemple : Si tu pèses 70kg, 71kg, 70.5kg, 70.2kg et 70.8kg en une semaine, la médiane est 70.5kg - un nombre plus stable que n'importe quel jour unique.

# educationBestPracticesTitle
source: Best Practices for Tracking
ar: أفضل الممارسات للتتبع
fr: Meilleures pratiques pour le suivi

# educationBestPracticesContent
source: For the most accurate tracking: • Weigh at the same time each day (morning is best) • Use the same scale • Weigh before eating or drinking • Weigh after using the bathroom • Wear similar clothing (or none) Consistency is more important than perfection!
ar: للتتبع الأكثر دقة: • وزن نفسك في نفس الوقت كل يوم (الصباح هو الأفضل) • استخدم نفس الميزان • وزن نفسك قبل الأكل أو الشرب • وزن نفسك بعد استخدام الحمام • ارتدِ ملابس متشابهة (أو لا شيء) الاتساق أهم من الكمال!
fr: Pour le suivi le plus précis : • Pèse-toi à la même heure chaque jour (le matin est le meilleur) • Utilise la même balance • Pèse-toi avant de manger ou de boire • Pèse-toi après être allé aux toilettes • Porte des vêtements similaires (ou aucun) La cohérence est plus importante que la perfection !

# educationPlateausTitle
source: Understanding Plateaus
ar: فهم الهضاب
fr: Comprendre les plateaux

# educationPlateausContent
source: Weight plateaus are completely normal and not a sign of failure! Your body may: • Retain water during muscle recovery • Adjust metabolism • Redistribute weight (fat loss, muscle gain) If you're following your plan, trust the process. Plateaus often break after a few weeks. Focus on consistency over speed.
ar: هضاب الوزن طبيعية تماماً وليست علامة على الفشل! جسمك قد: • يحتفظ بالماء أثناء استعادة العضلات • يعدل الأيض • يعيد توزيع الوزن (فقدان الدهون، اكتساب العضلات) إذا كنت تتبع خطتك، ثق بالعملية. الهضاب غالباً ما تنكسر بعد بضعة أسابيع. ركز على الاتساق على السرعة.
fr: Les plateaux de poids sont complètement normaux et ne sont pas un signe d'échec ! Ton corps peut : • Retenir de l'eau pendant la récupération musculaire • Ajuster le métabolisme • Redistribuer le poids (perte de graisse, gain musculaire) Si tu suis ton plan, fais confiance au processus. Les plateaux se brisent souvent après quelques semaines. Concentre-toi sur la cohérence plutôt que la vitesse.

# educationContextTrackingTitle
source: Why Track Context?
ar: لماذا تتبع السياق؟
fr: Pourquoi suivre le contexte ?

# educationContextTrackingContent
source: Tracking context (sleep, stress, exercise, meal timing) helps you understand patterns. You might discover: • Better sleep = better weight management • High stress affects your progress • Exercise timing matters • Meal timing impacts daily weight These insights help you make informed decisions about your journey.
ar: تتبع السياق (النوم، التوتر، التمرين، توقيت الوجبة) يساعدك على فهم الأنماط. قد تكتشف: • نوم أفضل = إدارة أفضل للوزن • التوتر العالي يؤثر على تقدمك • توقيت التمرين مهم • توقيت الوجبة يؤثر على الوزن اليومي هذه الرؤى تساعدك على اتخاذ قرارات مستنيرة حول رحلتك.
fr: Suivre le contexte (sommeil, stress, exercice, timing des repas) t'aide à comprendre les modèles. Tu pourrais découvrir : • Meilleur sommeil = meilleure gestion du poids • Le stress élevé affecte ta progression • Le timing de l'exercice compte • Le timing des repas impacte le poids quotidien Ces insights t'aident à prendre des décisions éclairées sur ton voyage.

# educationStayingMotivatedTitle
source: Staying Motivated
ar: البقاء متحفزاً
fr: Rester motivé

# educationStayingMotivatedContent
source: Weight tracking is a marathon, not a sprint. Remember: • Progress isn't always linear • Small daily actions compound over time • Setbacks are part of the journey • Celebrate non-scale victories too Focus on building sustainable habits. Every day you track is a win!
ar: تتبع الوزن هو ماراثون، وليس سباقاً. تذكر: • التقدم ليس دائماً خطياً • الإجراءات اليومية الصغيرة تتراكم مع مرور الوقت • النكسات جزء من الرحلة • احتفل أيضاً بانتصارات غير الميزان ركز على بناء عادات مستدامة. كل يوم تتتبع فيه هو انتصار!
fr: Le suivi du poids est un marathon, pas un sprint. Rappelle-toi : • Le progrès n'est pas toujours linéaire • Les petites actions quotidiennes s'accumulent avec le temps • Les revers font partie du voyage • Célèbre aussi les victoires non-échelle Concentre-toi sur la construction d'habitudes durables. Chaque jour que tu suis est une victoire !

# validationWeightGreaterThanZero
source: Please enter a weight greater than 0
ar: يرجى إدخال وزن أكبر من 0
fr: Veuillez entrer un poids supérieur à 0

# validationWeightLessThanMax
source: Please enter a weight less than {max}
ar: يرجى إدخال وزن أقل من {max}
fr: Veuillez entrer un poids inférieur à {max}

# validationUnusuallyLargeChange
source: This weight change seems unusually large. Please double-check your entry.
ar: يبدو أن هذا التغيير في الوزن كبير بشكل غير عادي. يرجى التحقق مرة أخرى من إدخالك.
fr: Ce changement de poids semble inhabituellement important. Veuillez vérifier votre saisie.

# validationSignificantChange
source: This is a significant change from your last entry. Is everything okay? You can still save it.
ar: هذا تغيير كبير من إدخالك الأخير. هل كل شيء على ما يرام؟ لا يزال بإمكانك حفظه.
fr: C'est un changement significatif par rapport à votre dernière entrée. Tout va bien ? Vous pouvez toujours l'enregistrer.

# validationDifferentFromInitial
source: This weight is quite different from your initial weight. Is this correct?
ar: هذا الوزن مختلف جداً عن وزنك الأولي. هل هذا صحيح؟
fr: Ce poids est très différent de votre poids initial. Est-ce correct ?

# validationGainingWhileLosing
source: You're gaining weight while your goal is to lose. That's okay—setbacks happen. Do you want to continue?
ar: أنت تكتسب وزناً بينما هدفك هو الفقدان. لا بأس - النكسات تحدث. هل تريد المتابعة؟
fr: Tu prends du poids alors que ton objectif est de perdre. Ce n'est pas grave - les revers arrivent. Veux-tu continuer ?

# validationLosingWhileGaining
source: You're losing weight while your goal is to gain. That's okay—setbacks happen. Do you want to continue?
ar: أنت تفقد وزناً بينما هدفك هو الزيادة. لا بأس - النكسات تحدث. هل تريد المتابعة؟
fr: Tu perds du poids alors que ton objectif est de gagner. Ce n'est pas grave - les revers arrivent. Veux-tu continuer ?

# validationMovingAwayFromGoal
source: You're moving away from your goal. This might be normal (fluctuations, life events). Is this correct?
ar: أنت تبتعد عن هدفك. قد يكون هذا طبيعياً (تقلبات، أحداث الحياة). هل هذا صحيح؟
fr: Tu t'éloignes de ton objectif. Cela peut être normal (fluctuations, événements de la vie). Est-ce correct ?

# validationUnusualWeight
source: This weight seems unusual compared to your recent entries. Is everything okay?
ar: يبدو أن هذا الوزن غير عادي مقارنة بإدخالاتك الأخيرة. هل كل شيء على ما يرام؟
fr: Ce poids semble inhabituel par rapport à tes entrées récentes. Tout va bien ?

# statusOnTrack
source: You're right on track! Keep up the great work!
ar: أنت على المسار الصحيح! استمر في العمل الجيد!
fr: Tu es sur la bonne voie ! Continue comme ça !

# statusAheadWithDays
source: You're ahead of schedule! {days} days ahead
ar: أنت متقدم! متقدم {days} أيام
fr: Tu es en avance ! {days} jours d'avance

# statusAhead
source: You're ahead of schedule! Great job!
ar: أنت متقدم! عمل رائع!
fr: Tu es en avance ! Super travail !

# statusBehind
source: You're making progress! A bit slower than planned, but you're still moving toward your goal.
ar: أنت تحرز تقدماً! أبطأ قليلاً من المخطط، لكنك لا تزال تتحرك نحو هدفك.
fr: Tu fais des progrès ! Un peu plus lentement que prévu, mais tu continues vers ton objectif.

# statusBehindSimple
source: You're making progress! Keep going!
ar: أنت تحرز تقدماً! استمر!
fr: Tu fais des progrès ! Continue !

# statusKeepTracking
source: Keep tracking to see your progress!
ar: استمر في التتبع لرؤية تقدمك!
fr: Continue à suivre pour voir ta progression !

# predictionOnTrack
source: You're on track to reach your goal around the planned date!
ar: أنت على المسار الصحيح للوصول إلى هدفك حول التاريخ المخطط!
fr: Tu es sur la bonne voie pour atteindre ton objectif autour de la date prévue !

# predictionAfterTarget
source: At your current rate, you'll reach your goal about {days} days after your target date. That's okay—progress is progress!
ar: بمعدلك الحالي، ستصل إلى هدفك بعد حوالي {days} يوماً من تاريخك المستهدف. لا بأس - التقدم هو التقدم!
fr: À ton rythme actuel, tu atteindras ton objectif environ {days} jours après ta date cible. Ce n'est pas grave - le progrès est le progrès !

# predictionBeforeTarget
source: At your current rate, you'll reach your goal about {days} days before your target date. Great job!
ar: بمعدلك الحالي، ستصل إلى هدفك قبل حوالي {days} يوماً من تاريخك المستهدف. عمل رائع!
fr: À ton rythme actuel, tu atteindras ton objectif environ {days} jours avant ta date cible. Super travail !

# streakStartTracking
source: Start tracking to build your streak!
ar: ابدأ التتبع لبناء سلسلتك!
fr: Commence à suivre pour construire ta série !

# streakGreatStart
source: Great start! Keep it going!
ar: بداية رائعة! استمر!
fr: Super début ! Continue !

# streakDaysBuilding
source: {days} days in a row! You're building a great habit!
ar: {days} أيام متتالية! أنت تبني عادة رائعة!
fr: {days} jours d'affilée ! Tu construis une grande habitude !

# streakDaysAmazing
source: {days} days in a row! You're doing amazing!
ar: {days} أيام متتالية! أنت تقوم بعمل رائع!
fr: {days} jours d'affilée ! Tu fais du super travail !

# streakDaysIncredible
source: {days} days in a row! This is incredible!
ar: {days} أيام متتالية! هذا لا يصدق!
fr: {days} jours d'affilée ! C'est incroyable !

# streakDaysChampion
source: {days} days in a row! You're a tracking champion!
ar: {days} أيام متتالية! أنت بطل في التتبع!
fr: {days} jours d'affilée ! Tu es un champion du suivi !

source: Insights Coming Soon
fr: Insights à venir

# insightsComingSoonMessage
source: Track your weight for 7 days to unlock insights and progression analysis.
fr: Suis ton poids pendant 7 jours pour débloquer les insights et l'analyse de progression.

# insightsDaysRemaining
source: {days} days remaining
fr: {days} jours restants
